Revit 2027 API
CableSize.GetCableSize Method
 Gets the Cable Size data by given Cable Size id.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static CableSize GetCableSize(
	Document document,
	ElementId cableSizeId
)
Public Shared Function GetCableSize (
	document As Document,
	cableSizeId As ElementId
) As CableSize
public:
static CableSize^ GetCableSize(
	Document^ document,
	ElementId^ cableSizeId
)
static member GetCableSize :
        document : Document *
        cableSizeId : ElementId -> CableSize
Parameters
document Document
 The document.
cableSizeId ElementId
 The Cable Size id.
Return Value
CableSize
 The Cable Size data.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
See Also
Reference
CableSize Class
Autodesk.Revit.DB.Electrical Namespace